Repository: snoups/3xui-shop
Catalog: app/locales/*/LC_MESSAGES/bot.po
Languages: ru

# maintenance:ntf:try_later
source: 🚧 <i>The bot is in maintenance mode. Please try again later.</i>
ru: 🚧 <i>Бот находится в режиме обслуживания. Пожалуйста, попробуйте позже.</i>

# payment:event:payment_succeeded
source: 💳 <b>Event: Purchase completed!</b> Payment ID: <tg-spoiler><code>{payment_id}</code></tg-spoiler> User ID: <code>{user_id}</code> <code>{devices}</code> | <code>{duration}</code>
ru: 💳 <b>Событие: Покупка завершена!</b> ID платежа: <blockquote><code>{payment_id}</code></blockquote> ID пользователя: <code>{user_id}</code> <code>{devices}</code> | <code>{duration}</code>

# payment:event:payment_canceled
source: 💳 <b>Event: Purchase canceled!</b> Payment ID: {payment_id} User ID: {user_id} <code>{devices}</code> | <code>{duration}</code>
ru: 💳 <b>Событие: Покупка отменена!</b> ID платежа: <tg-spoiler><code>{payment_id}</code></tg-spoiler> ID пользователя: <code>{user_id}</code> <code>{devices}</code> | <code>{duration}</code>

# payment:gateway:telegram_stars
source: Telegram Stars
ru: Звёзды Telegram

# payment:invoice:title
source: Subscription | {devices} for {duration}
ru: Подписка | {devices} на {duration}

# payment:invoice:description
source: Subscription | {devices} for {duration}
ru: Подписка | {devices} на {duration}

# payment:gateway:yookassa
source: YooKassa
ru: ЮKassa

# payment:gateway:yoomoney
source: YooMoney
ru: ЮMoney

# admin_tools:message:main
source: 🛠 <b>Admin tools:</b>
ru: 🛠 <b>Административные инструменты:</b>

# backup:popup:success
source: ✅ Backup sent successfully.
ru: ✅ Резервная копия успешно отправлена.

# backup:popup:not_found
source: ❌ Database file not found.
ru: ❌ Файл базы данных не найден.

# backup:popup:failed
source: ❌ Failed to send backup.
ru: ❌ Не удалось отправить резервную копию.

# backup:popup:error
source: ❌ An error occurred during backup.
ru: ❌ Возникла ошибка при создании резервной копии.

# invite_editor:message:main
source: 📊 <b>Invite Link Management</b> Here you can create and manage invite links to track user sources.
ru: 📊 <b>Управление инвайт-ссылками</b> Здесь вы можете создавать и управлять инвайт-ссылками для отслеживания источников пользователей.

# invite_editor:message:enter_name
source: <b>Enter a name for the invite link.</b> <i>This name will be used to generate a unique tracking code.</i>
ru: <b>Введите название для инвайт-ссылки.</b> <i>Это название будет использовано для генерации уникального трекинг-кода.</i>

# invite_editor:message:created_success
source: ✅ <b>Invite link created successfully!</b> <b>Name:</b> {name} <b>Link:</b> <code>{link}</code> <i>Share this link to track users coming from this source.</i>
ru: ✅ <b>Инвайт-ссылка успешно создана!</b> <b>Название:</b> {name} <b>Ссылка:</b> <code>{link}</code> <i>Используйте эту ссылку для отслеживания статистики по перешедшим по ней пользователям.</i>

# invite_editor:ntf:create_failed
source: ❌ Failed to create invite link. Please try a different name.
ru: ❌ Не удалось создать ссылку. Пожалуйста, попробуйте другое имя.

# invite_editor:message:list
source: 📊 <b>Invite Links</b> <i>Select a link to see details:</i>
ru: 📊 <b>Инвайт-ссылки</b> <i>Выберите ссылку для подробностей:</i>

# invite_editor:message:no_invites
source: <i>There are no invite links yet. Create your first invite link!</i>
ru: <i>У вас ещё нет инвайт-ссылок. Сперва создайте хотя бы одну ссылку!</i>

# invite_editor:popup:not_found
source: ❌ Invite link not found
ru: ❌ Инвайт-ссылка не найдена

# invite_editor:revenue:none
source: no data
ru: нет данных

# invite_editor:message:details
source: 📊 <b>Invite Link Details</b> <b>Name:</b> {name} <b>Link:</b> <code>{link}</code> <b>Clicks:</b> {clicks} <b>Created:</b> {created_at} <b>Status:</b> {status} <b>💵 Revenue:</b> {revenue_text} <b>👥 User Statistics:</b> • <b>Total users:</b> {users_count} • <b>Used trial:</b> {trial_users_count} • <b>Made payment:</b> {paid_users_count} • <b>Repeat customers:</b> {repeat_customers_count}
ru: 📊 <b>Подробности инвайт-ссылки</b> <b>Название:</b> {name} <b>Ссылка:</b> <code>{link}</code> <b>Клики:</b> {clicks} <b>Создано:</b> {created_at} <b>Статус:</b> {status} <b>💵 Выручка:</b> {revenue_text} <b>👥 Статистика пользователей:</b> • <b>Всего пользователей:</b> {users_count} • <b>Использовали триал:</b> {trial_users_count} • <b>Сделали оплату:</b> {paid_users_count} • <b>Повторили оплату:</b> {repeat_customers_count}

# invite_editor:popup:status_changed
source: Invite link status changed: {status}
ru: Статус инвайт-ссылки изменен: {status}

# invite_editor:popup:deleted
source: Invite link "{name}" deleted
ru: ✅ Инвайт-ссылка "{name}" удалена

# admin_tools:button:server_management
source: 🌐 Server management
ru: 🌐 Управление серверами

# admin_tools:button:statistics
source: 📈 Statistics
ru: 📈 Статистика

# admin_tools:button:user_editor
source: 👤 User editor
ru: 👤 Редактор пользователей

# admin_tools:button:invite_editor
source: 🔗 Invite Links
ru: 🔗 Инвайт-ссылки

# admin_tools:button:promocode_editor
source: 🎟 Promocode editor
ru: 🎟 Редактор промокодов

# admin_tools:button:notification
source: 📣 Send notification
ru: 📣 Отправить уведомление

# admin_tools:button:create_backup
source: 💾 Create backup
ru: 💾 Создать резервную копию

# admin_tools:button:maintenance_mode
source: 🚧 Maintenance mode
ru: 🚧 Режим обслуживания

# admin_tools:button:restart_bot
source: 🔄 Restart bot
ru: 🔄 Перезапустить бота

# admin_tools:button:test_button
source: 🔍 Test button
ru: 🔍 Тестовая кнопка

# promocode_editor:button:create
source: 🆕 Create
ru: 🆕 Создать

# promocode_editor:button:delete
source: 🗑 Delete
ru: 🗑 Удалить

# promocode_editor:button:edit
source: ✏️ Edit
ru: ✏️ Изменить

source: 1 day
ru: 1 день

# maintenance_mode:button:disable
source: 🔴 Disable
ru: 🔴 Выключить

# maintenance_mode:button:enable
source: 🟢 Enable
ru: 🟢 Включить

# server_management:button:sync
source: 🔄 Sync
ru: 🔄 Синхронизировать

# server_management:button:add
source: 🆕 Add
ru: 🆕 Добавить

# server_management:button:ping
source: 📶 Ping
ru: 📶 Пинг

# server_management:button:delete
source: 🗑 Delete
ru: 🗑 Удалить

# server_management:button:confirm
source: ✅ Confirm
ru: ✅ Подтвердить

# notification:button:send_to_user
source: 📩 Send to user
ru: 📩 Пользователю

# notification:button:send_to_all
source: 📣 Send to all
ru: 📣 Всем

# notification:button:last_notification
source: 💬 Last notification
ru: 💬 Последнее уведомление

# notification:button:edit
source: ✏️ Edit
ru: ✏️ Изменить

# notification:button:delete
source: 🗑 Delete
ru: 🗑 Удалить

# notification:button:confirm
source: ✅ Confirm and send
ru: ✅ Подтвердить и отправить

# invite_editor:button:create_invite
source: ➕ Create New Invite Link
ru: ➕ Создать новую инвайт-ссылку

# invite_editor:button:list_invites
source: 📋 List Invite Links
ru: 📋 Показать все инвайт-ссылки

# invite_editor:button:previous_page
source: ◀️ Previous page
ru: ◀️ Предыдущая страница

# invite_editor:button:next_page
source: ▶️ Next page
ru: ▶️ Следующая страница

# invite_editor:button:disable
source: 🔴 Disable
ru: 🔴 Выключить

# invite_editor:button:enable
source: 🟢 Enable
ru: 🟢 Включить

# invite_editor:button:delete
source: 🗑️ Delete
ru: 🗑️ Удалить

# maintenance:status:enabled
source: enabled
ru: включен

# maintenance:status:disabled
source: disabled
ru: выключен

# maintenance:message:main
source: 🚧 <b>Maintenance mode:</b> {status}
ru: 🚧 <b>Режим обслуживания:</b> {status}

# maintenance:popup:enabled
source: 🟢 Maintenance mode enabled. The bot is temporarily unavailable for users.
ru: 🟢 Режим обслуживания включен. Бот временно недоступен для пользователей.

# maintenance:popup:disabled
source: 🔴 Maintenance mode disabled. The bot is available for users.
ru: 🔴 Режим обслуживания выключен. Бот доступен для пользователей.

# notification:message:main
source: <b>📣 Send notification:</b>
ru: <b>📣 Отправить уведомление:</b>

# notification:message:send_to_user
source: <b>📣 Send notification:</b> <i>Send user id or forward message from user</i>
ru: <b>📣 Отправить уведомление:</b> (для пользователя) <i>Отправьте id пользователя или пересланное сообщение от пользователя</i>

# notification:message:send_message_for_user
source: <b>📣 Send notification:</b> <i>Send message for <code>{user_id}</code> (first name: {first_name})</i>
ru: <b>📣 Отправить уведомление:</b> (для пользователя) <i>Отправьте сообщение для <code>{user_id}</code> (имя: {first_name})</i>

# notification:ntf:user_not_found
source: <i>❌ User not found.</i>
ru: <i>❌ Пользователь не найден.</i>

# notification:ntf:invalid_user_id
source: <i>❌ Invalid user id.</i>
ru: <i>❌ Некорректный id пользователя.</i>

# notification:message:confirm_send_notification
source: <b>💬 Confirm notification with text:</b> <i>To edit, resend the text.</i> {text}
ru: 💬 <b>Подтвердите отправку уведомления:</b> <i>Для редактирования, отправьте новый текст.</i> {text}

# notification:ntf:invalid_message_text
source: <i>❌ Invalid message text.</i>
ru: <i>❌ Некорректный текст уведомления.</i>

# notification:ntf:sent_success
source: <i>✅ Notification sent successfully.</i>
ru: <i>✅ Уведомление успешно отправлено.</i>

# notification:ntf:failed_to_send_message
source: <i>❌ Failed to send notification.</i>
ru: <i>❌ Не удалось отправить уведомление.</i>

# notification:message:send_to_all
source: <b>📣 Send notification:</b> <i>Send message for all</i>
ru: <b>📣 Отправить уведомление:</b> (для всех) <i>Отправьте сообщение для всех</i>

# notification:ntf:sending_to_all
source: <i>📣 Sending {count} notifications...</i>
ru: <i>📣 Отправка {count} уведомлений...</i>

# notification:ntf:sent_success_all
source: <i>✅ Notifications sent successfully. Success: {success} Failed: {failed}</i>
ru: <i>✅ Уведомления успешно отправлены. Успешно: {success} Не удалось: {failed}</i>

# notification:message:last_notification
source: <b>💬 Last notification:</b> <i>Count:</i> {message_count} <i>Text:</i> {message_text}
ru: <b>💬 Последнее уведомление:</b> <i>Количество:</i> {message_count} <i>Текст:</i> {message_text}

# notification:ntf:last_notification_not_found
source: <i>❌ Last notification not found.</i>
ru: <i>❌ Последнее уведомление не найдено.</i>

# notification:message:edit_notification
source: <b>💬 Edit last notification:</b> <i>Send new message</i>
ru: <b>💬 Редактирование последнего уведомления:</b> <i>Отправьте новое сообщение</i>

# notification:ntf:editing_notification
source: <i>💬 Editing {count} notifications...</i>
ru: <i>💬 Редактирование {count} уведомлений...</i>

# notification:ntf:edited_failed
source: <i>❌ Failed to edit notification.</i>
ru: <i>❌ Не удалось изменить уведомление.</i>

# notification:ntf:edited_success_all
source: <i>✅ Notifications edited successfully. Success: {success} Failed: {failed}</i>
ru: <i>✅ Уведомления успешно отредактированы. Успешно: {success} Не удалось: {failed}</i>

# notification:ntf:edited_success
source: <i>✅ Notification edited successfully.</i>
ru: <i>✅ Уведомление успешно отредактировано.</i>

# notification:ntf:no_messages_to_edit
source: <i>❌ No messages to edit.</i>
ru: <i>❌ Нет сообщений для редактирования.</i>

# notification:ntf:deleted_failed
source: <i>❌ Failed to delete notification.</i>
ru: <i>❌ Не удалось удалить уведомление.</i>

# notification:ntf:deleted_success_all
source: <i>✅ Notifications deleted successfully. Success: {success} Failed: {failed}</i>
ru: <i>✅ Уведомления успешно удалены. Успешно: {success} Не удалось: {failed}</i>

# notification:ntf:deleted_success
source: <i>✅ Notification deleted successfully.</i>
ru: <i>✅ Уведомление успешно удалено.</i>

# promocode_editor:message:main
source: 🎟️ <b>Promocode editor:</b>
ru: 🎟️ <b>Редактор промокодов:</b>

# promocode_editor:message:create
source: 🎟️ <b>Create promocode:</b> <i>Specify the duration</i>
ru: 🎟️ <b>Создать промокод:</b> <i>Укажите длительность</i>

# promocode_editor:ntf:created_success
source: ✅ <i>Created promocode:</i> <pre>{promocode}</pre> <i>Duration: {duration}</i>
ru: ✅ <i>Созданный промокод:</i> <pre>{promocode}</pre> <i>Длительность: {duration}</i>

# promocode_editor:ntf:create_failed
source: ❌ <i>Failed to create promocode.</i>
ru: ❌ <i>Не удалось создать промокод.</i>

# promocode_editor:message:delete
source: 🎟️ <b>Delete promocode:</b> <i>Send promocode to delete</i>
ru: 🎟️ <b>Удалить промокод:</b> <i>Отправьте промокод для удаления</i>

# promocode_editor:ntf:deleted_success
source: ✅ <i>Promocode {promocode} deleted successfully.</i>
ru: ✅ <i>Промокод {promocode} успешно удален.</i>

# promocode_editor:ntf:delete_failed
source: ❌ <i>Promocode not found.</i>
ru: ❌ <i>Не удалось удалить промокод.</i>

# promocode_editor:message:edit
source: 🎟️ <b>Edit promocode:</b> <i>Send promocode to edit</i>
ru: 🎟️ <b>Изменить промокод:</b> <i>Отправьте промокод для редактирования</i>

# promocode_editor:message:edit_duration
source: 🎟️ <b>Edit promocode:</b> Promocode: {promocode} Current duration: {duration} <i>Specify the new duration</i>
ru: 🎟️ <b>Изменить промокод:</b> Промокод: {promocode} Текущая длительность: {duration} <i>Укажите новую длительность</i>

# promocode_editor:ntf:edit_failed
source: ❌ <i>Promocode not found or already activated.</i>
ru: ❌ <i>Промокод не найден или уже активирован.</i>

# promocode_editor:ntf:edited_success
source: ✅ <i>Edited promocode:</i> <pre>{promocode}</pre> <i>New duration: {duration}</i>
ru: ✅ <i>Измененный промокод:</i> <pre>{promocode}</pre> <i>Новая длительность: {duration}</i>

# restart_bot:popup:process
source: 🔄 Bot restarting...
ru: 🔄 Перезапуск бота...

# server_management:message:main
source: 🌐 <b>Server management:</b>
ru: 🌐 <b>Управление серверами:</b>

# server_management:message:empty
source: <i>The list of servers is empty.</i>
ru: <i>Список серверов пуст.</i>

# server_management:popup:synced
source: Servers synced.
ru: Серверы синхронизированы.

# server_management:message:add
source: 🌐 <b>Add server:</b>
ru: 🌐 <b>Добавить сервер:</b>

# server_management:message:enter_name
source: <i>Enter the server name</i>
ru: <i>Введите имя сервера</i>

# server_management:message:enter_host
source: <i>Enter the server host (URL to panel)</i>
ru: <i>Введите хост сервера (ссылка на панель)</i>

# server_management:message:enter_max_clients
source: <i>Enter the maximum number of clients</i>
ru: <i>Введите максимальное количество клиентов</i>

# server_management:message:confirm
source: <i>Press confirm to add the server</i>
ru: <i>Нажмите подтвердить для добавления сервера</i>

# server_management:ntf:name_exists
source: ❌ <i>A server with that name already exists. Enter a different name.</i>
ru: ❌ <i>Сервер с таким именем уже существует. Введите другое имя.</i>

# server_management:ntf:invalid_host
source: ❌ <i>Enter a valid URL or IP address.</i>
ru: ❌ <i>Введите корректный URL или IP адрес.</i>

# server_management:ntf:invalid_max_clients
source: ❌ <i>Enter a valid number.</i>
ru: ❌ <i>Введите корректное число.</i>

# server_management:popup:added_success
source: ✅ Server added successfully.
ru: ✅ Сервер успешно добавлен.

# server_management:popup:add_failed
source: ❌ Failed to add the server.
ru: ❌ Не удалось добавить сервер.

# server_management:message:server_info
source: ️️️️🌐 <b>Server {server_name}:</b> <b>Host:</b> {host} <b>Status:</b> {status} <b>Clients:</b> {clients}/{max_clients}
ru: 🌐 <b>Сервер {server_name}:</b> <b>Хост:</b> {host} <b>Статус:</b> {status} <b>Клиенты:</b> {clients}/{max_clients}

# server_management:popup:ping
source: 🟢 Ping: {ping} ms.
ru: 🟢 Пинг: {ping} ms.

# server_management:popup:ping_failed
source: ❌ Failed to ping server {server_name}.
ru: ❌ Не удалось пингануть сервер {server_name}.

# server_management:popup:deleted_success
source: ✅ Server deleted successfully.
ru: ✅ Сервер успешно удален.

# server_management:popup:delete_failed
source: ❌ Failed to delete the server.
ru: ❌ Не удалось удалить сервер.

# global:popup:development
source: Under development!
ru: В разработке!

# download:message:choose_platform
source: 📲 <b>Choose your platform:</b>
ru: 📲 <b>Выберите вашу платформу:</b>

# download:message:connect_to_vpn
source: <b>{platform}:</b> First, you need to download the app on your device. After installation, you can use the `🔌 Connect` button <i>(the key will be automatically connected in the app)</i> or copy your key and paste it manually.
ru: <b>{platform}:</b> Сначала вам необходимо скачать приложение на ваше устройство. После установки вы можете использовать кнопку `🔌 Подключиться` <i>(ключ будет автоматически подключён в приложении)</i> или скопировать свой ключ и вставить его вручную.

# download:button:download
source: 📥 Download
ru: 📥 Скачать

# download:button:connect
source: 🔌 Connect
ru: 🔌 Подключиться

# main_menu:message:main
source: Welcome, {name}! 🎉 3X-UI SHOP — your reliable assistant in the world of free internet. We offer safe and fast connections to any internet services using the XRAY protocol. Our service works even in China, Iran, and Russia. 🚀 HIGH SPEED 🔒 SECURITY 📱 SUPPORT FOR ALL PLATFORMS ♾️ UNLIMITED ✅ GUARANTEE AND TRIAL PERIOD 👥 REFERRAL SYSTEM
ru: Добро пожаловать, {name}! 🎉 3X-UI SHOP — ваш надёжный помощник в мире свободного интернета. Мы предлагаем безопасные и быстрые соединения с любыми интернет-сервисами с использованием протокола XRAY. Наш сервис работает в Китае, Иране и России. 🚀 ВЫСОКАЯ СКОРОСТЬ 🔒 БЕЗОПАСНОСТЬ 📱 ПОДДЕРЖКА ВСЕХ ПЛАТФОРМ ♾️ БЕЗЛИМИТ ✅ ГАРАНТИЯ И ПРОБНЫЙ ПЕРИОД 👥 РЕФЕРАЛЬНАЯ СИСТЕМА

# referral:button:get_referred_trial
source: 🎁 Claim gift
ru: 🎁 ПОЛУЧИТЬ ПОДАРОК

# subscription:button:get_trial
source: 🎁 TRY FOR FREE
ru: 🎁 ПОПРОБОВАТЬ БЕСПЛАТНО

# main_menu:button:profile
source: 👤 Profile
ru: 👤 Профиль

# main_menu:button:subscription
source: 💳 Subscription
ru: 💳 Подписка

# main_menu:button:referral
source: 👥 Referral
ru: 👥 Пригласить

# main_menu:button:support
source: 🆘 Support
ru: 🆘 Помощь

# main_menu:button:admin_tools
source: 🛠 Admin tools
ru: 🛠 Административные инструменты

# misc:button:close_notification
source: 🔕 Close
ru: 🔕 Закрыть

# misc:button:back
source: ◀️ Back
ru: ◀️ Назад

# misc:button:back_to_main_menu
source: ◀️ Back to main menu
ru: ◀️ Назад в главное меню

# misc:button:cancel
source: ❌ Cancel
ru: ❌ Отменить

# profile:message:main
source: 👤 <b>Your profile:</b> Name: {name} ID: {id}
ru: 👤 <b>Ваш профиль:</b> Имя: {name} ID: {id}

# profile:message:subscription_none
source: <i>You don't have a subscription yet. To purchase one, go to the subscription page by clicking the button below.</i>
ru: <i>У вас ещё нет подписки. Чтобы приобрести её, перейдите на страницу подписки, нажав на кнопку ниже.</i>

# profile:message:subscription
source: 📅 <b>Subscription:</b> Devices: {devices}
ru: 📅 <b>Подписка:</b> Количество устройств: {devices}

# profile:message:subscription_expiry_time
source: Expires in: {expiry_time}
ru: Заканчивается через: {expiry_time}

# profile:message:subscription_expired
source: ⚠️ <i>Subscription period has expired.</i>
ru: ⚠️ <i>Срок действия подписки истёк.</i>

# profile:message:statistics
source: 📊 <b>Statistics:</b> Total: {total} Uploaded: ↑ {up} Downloaded: ↓ {down}
ru: 📊 <b>Статистика:</b> Всего: {total} Отправлено: ↑ {up} Получено: ↓ {down}

# subscription:popup:error_fetching_data
source: ❌ Error fetching data. Please try again later.
ru: ❌ Ошибка получения данных. Пожалуйста, попробуйте ещё раз позже.

# profile:message:key
source: 🔑 <b>Your key:</b> <i>(Closes after {seconds_text})</i> <pre>{key}</pre>
ru: 🔑 <b>Ваш ключ:</b> <i>(Закроется через {seconds_text})</i> <pre>{key}</pre>

source: 10 seconds
ru: 10 секунд

source: 1 second
ru: 1 секунду

# profile:button:buy_subscription
source: 💳 Buy subscription
ru: 💳 Купить подписку

# profile:button:show_key
source: 🔑 Show key
ru: 🔑 Показать ключ

# profile:button:connect
source: 🔌 Connect
ru: 🔌 Подключиться

# referral:message:user_summary
source: 🎉 Invite friends and get rewarded!
ru: 🎉 Приглашайте друзей и получайте вознаграждение!

# referral:message:user_summary_referred_trial_enabled
source: 🔗 When a new user follows your invitation link and clicks the «🎁 Claim Gift» button, they get an extended promo period of {referred_duration}.
ru: 🔗 Когда новый пользователь переходит по вашей пригласительной ссылке и нажимает кнопку «🎁 Получить подарок», он получает расширенный промо-период {referred_duration}.

# referral:message:user_summary_invite_link
source: 📎 Your personal link: <code>{referral_link}</code> (click on the link to copy) 👀 Clicks on your link: {referrals_count}
ru: 📎 Ваша персональная ссылка: <code>{referral_link}</code> (нажмите на ссылку, чтобы скопировать) 👀 Переходов по вашей ссылке: {referrals_count}

# referral:message:user_summary_explain_referrer_days
source: 💸 <b>Two-level referral system</b> 👥 <b>For each successful payment</b> for a subscription using your link: 1️⃣ You get <b>+{first_referrer_duration}</b> to your subscription 2️⃣ You also get <b>+{second_referrer_duration}</b> from users invited by your referrals!
ru: 💸 <b>Двухуровневая реферальная система</b> 👥 <b>За каждую успешную оплату</b> подписки, по вашей ссылке: 1️⃣ Вы получаете <b>+{first_referrer_duration}</b> к своей подписке 2️⃣ Вы также получаете <b>+{second_referrer_duration}</b> от пользователей, приглашенных вашими рефералами!

# referral:message:user_summary_explain_referrer_money
source: 💸 <b>Two-level referral system</b> 👥 <b>For each successful payment</b> for a subscription using your link: 1️⃣ You get on your balance <b>{first_referrer_rate}%</b> of payments made by your referral! 2️⃣ You also get <b>{second_referrer_rate}%</b> of payments from users invited by your referrals!
ru: 💸 <b>Двухуровневая реферальная система</b> 👥 <b>За каждую успешную оплату</b> подписки по вашей ссылке: 1️⃣ Вы получаете на свой баланс <b>{first_referrer_rate}%</b> платежей, совершенных вашим рефералом! 2️⃣ Также вы получаете <b>{second_referrer_rate}%</b> платежей от пользователей, приглашенных вашими рефералами!

# referral:message:user_summary_referrer_rewards
source: 📊 <b>Your reward for payments by referrals</b> First level: {first_level_rewards_sum} Second level: {second_level_rewards_sum} <i>*(Rewards are credited within 15 minutes. Pending rewards: {pending_rewards_count})</i>
ru: 📊 <b>Ваше вознаграждение за платежи рефералов</b> Первый уровень рефералов: {first_level_rewards_sum} Второй уровень рефералов: {second_level_rewards_sum} <i>*(Награды начисляются в течение 15 минут. Ожидают: {pending_rewards_count})</i>

# referral:popup:no_available_servers
source: ❌ No available servers found. Please try again later.
ru: ❌ Нет доступных серверов. Попробуйте позже.

# referral:popup:trial_unavailable_for_user
source: ❌ Trial is not available for you now.
ru: ❌ Пробный период уже был использован.

# subscription:ntf:trial_activate_success
source: ✅ Trial period was successfully activated! <i>You have received <b>{duration}</b> to your subscription.</i> <b>Click 'Connect' button to download and connect to your new VPN application</b> Your private key for applications is always available at <b>Profile</b>
ru: ✅ Пробный период был успешно активирован! <i>Вы получили <b>{duration}</b> к своей подписке.</i> <b>По кнопке 'Подключиться' бот поможет вам скачать приложение и добавить вашу конфигурацию</b> Ваш приватный ключ VPN всегда доступен в разделе <b>'Профиль'</b>

# referral:ntf:referred_trial_activate_failed
source: ❌ <i>Failed to your trial period, please try again later or contact administrator.</i>
ru: ❌ <i>Не удалось активировать пробный период, пожалуйста попробуйте позже, либо обратитесь к администратору</i>

# subscription:button:connect
source: 🔌 Connect
ru: 🔌 Подключиться

# subscription:button:change
source: 💳 Change subscription
ru: 💳 Изменить подписку

# subscription:button:buy
source: 💳 Buy subscription
ru: 💳 Купить подписку

# subscription:button:extend
source: 💳 Extend subscription
ru: 💳 Продлить подписку
