Repository: snoups/3xui-shop
Catalog: app/locales/*/LC_MESSAGES/bot.po
Languages: ru

# subscription:button:activate_promocode
source: 🎟️ Activate promocode
ru: 🎟️ Активировать промокод

# subscription:button:change_devices
source: ◀️ Change number of devices
ru: ◀️ Изменить количество устройств

# subscription:button:pay
source: 💳 Pay
ru: 💳 Оплатить

# subscription:button:change_payment_method
source: ◀️ Change payment method
ru: ◀️ Изменить способ оплаты

# subscription:button:change_duration
source: ◀️ Change duration
ru: ◀️ Изменить длительность

# subscription:button:download_app
source: 🔌 Connect
ru: 🔌 Подключиться

# payment:message:order_extend
source: 🛒 <b>Confirmation of extension:</b> Devices: {devices} Extension period: {duration} Price: {price} {currency} <i>The number of devices will remain the same, and the new subscription duration will be added to the remaining time!</i>
ru: 🛒 <b>Подтверждение продления:</b> Количество устройств: {devices} Срок продления: {duration} Стоимость: {price} {currency} <i>Количество устройств останется прежним, а новый срок подписки добавится к оставшемуся времени!</i>

# payment:message:order_change
source: 🛒 <b>Confirmation of change:</b> Devices: {devices} Duration: {duration} Price: {price} {currency} <i>The number of devices and subscription duration will be changed without recalculating the previous data!</i>
ru: 🛒 <b>Подтверждение изменения:</b> Количество устройств: {devices} Длительность: {duration} Стоимость: {price} {currency} <i>Количество устройств и срок подписки будут изменены, без перерасчета предыдущих данных!</i>

# payment:message:order
source: 🛒 <b>Confirmation of purchase:</b> Devices: {devices} Duration: {duration} Price: {price} {currency} <i>After the payment, a unique key for connecting to the VPN will be generated for you. The key will be available on your profile page.</i>
ru: 🛒 <b>Подтверждение покупки:</b> Количество устройств: {devices} Длительность: {duration} Стоимость: {price} {currency} <i>После оплаты для вас будет сгенерирован уникальный ключ для подключения к VPN. Ключ будет доступен на странице профиля.</i>

# payment:popup:error
source: ❌ An error occurred during creating payment.
ru: ❌ Возникла ошибка при создании платежа.

# promocode:message:main
source: 🎟️ <b>Activate promocode:</b> <i>Send promocode to activation</i>
ru: 🎟️ <b>Активировать промокод:</b> <i>Отправьте промокод для активации</i>

# promocode:ntf:no_available_servers
source: ❌ <i>No available servers found. Please try again later.</i>
ru: ❌ <i>Нет доступных серверов. Попробуйте позже.</i>

# promocode:message:activated_success
source: ✅ <b>Promocode {promocode} was successfully activated!</b> <i>You have received {duration} to your subscription.</i>
ru: ✅ <b>Промокод {promocode} был успешно активирован!</b> <i>Вы получили {duration} к своей подписке.</i>

# promocode:ntf:activate_failed
source: ❌ <i>Failed to activate promocode, please try again later.</i>
ru: ❌ <i>Не удалось активировать промокод, попробуйте позже.</i>

# promocode:ntf:activate_invalid
source: ❌ <i>Promocode is invalid or has already been activated.</i>
ru: ❌ <i>Промокод недействителен или уже активирован.</i>

# subscription:message:expired
source: ⚠️ <b>Subscription period has expired!</b> <i>Extend your subscription to continue using our service.</i>
ru: ⚠️ <b>Срок действия подписки истёк!</b> <i>Продлите свою подписку, чтобы продолжить использовать наш сервис.</i>

# subscription:message:active
source: ✅ <b>You already have an active subscription:</b> Devices: {devices} Expires on: {expiry_time}
ru: ✅ <b>У вас уже есть активная подписка:</b> Количество устройств: {devices} Заканчивается через: {expiry_time}

# subscription:message:not_active
source: ⚠️ <b>You do not have an active subscription!</b> <i>It seems that you haven't purchased a subscription yet. Buy a subscription to start using our service.</i>
ru: ⚠️ <b>У вас нет активной подписки!</b> <i>Похоже, вы еще не приобрели подписку. Купите подписку, чтобы начать пользоваться нашим сервисом.</i>

# subscription:popup:error_fetching_plan
source: ❌ Your plan is no longer supported. You need to change your subscription.
ru: ❌ Ваш тарифный план больше не поддерживается. Вам необходимо изменить подписку.

# subscription:message:duration
source: ⏳ <b>Specify the duration:</b>
ru: ⏳ <b>Выберите длительность:</b>

# subscription:message:devices
source: 📱 <b>Select the number of devices:</b>
ru: 📱 <b>Выберите количество устройств:</b>

# subscription:popup:no_available_servers
source: ❌ No available servers found. Please try again later.
ru: ❌ Доступных серверов не найдено. Попробуйте позже.

# subscription:message:payment_method
source: 💳 <b>Choose a payment method:</b>
ru: 💳 <b>Выберите способ оплаты:</b>

# subscription:popup:trial_unavailable_for_user
source: ❌ Trial is not available for you now.
ru: ❌ Сейчас вам не доступен пробный период.

# subscription:popup:trial_activate_failed
source: ❌ Failed to activate trial period. Please, try later.
ru: ❌ Не удалось активировать пробный период. Попробуйте позже.

# support:message:main
source: 🆘 <b>Support:</b> For collaboration, improvements to functionality, and any other inquiries, please contact the operator.
ru: 🆘 <b>Помощь:</b> По вопросам сотрудничества, улучшения функционала и другим вопросам, пожалуйста, свяжитесь с оператором.

# support:message:how_to_connect
source: ℹ️ <b>How to connect:</b> After subscribing, you will be given an access key that you can use to connect to our VPN. If you have a key, go to the application download page and connect the key.
ru: ℹ️ <b>Как подключиться:</b> После подписки вам будет предоставлен ключ доступа, который вы можете использовать для подключения к нашему VPN. Если у вас уже есть ключ, перейдите на страницу загрузки приложения и подключите его.

# support:message:vpn_not_working
source: ℹ️ <b>VPN not working:</b> There could be several reasons why VPN is not working. Please check the following: - Ensure your internet connection is stable. - Make sure your subscription is active. - Try reconnecting or restarting the app. If the issue persists, please contact support.
ru: ℹ️ <b>VPN не работает:</b> Может быть несколько причин, по которым VPN не работает. Пожалуйста, проверьте следующее: - Проверьте, что ваша подписка активна. - Убедитесь, что ваше интернет-соединение стабильно. - Попробуйте переподключиться или перезапустить приложение. Если проблема не устранена, пожалуйста, свяжитесь с оператором.

# support:button:contact
source: 👨‍💻 Contact the operator
ru: 👨‍💻 Связаться с оператором

# support:button:how_to_connect
source: ❓ How to connect
ru: ❓ Как подключиться

# support:button:vpn_not_working
source: ❓ VPN not working
ru: ❓ VPN не работает

# support:button:buy_subscription
source: 💳 Buy subscription
ru: 💳 Купить подписку

# support:button:download_app
source: 📥 Download app
ru: 📥 Скачать приложение

# payment:message:purchase_success
source: ✅ <b>Payment successful!</b> 🔑 <b>Your key:</b> <pre>{key}</pre> <i>The key will be saved in your profile.</i> To start using our service, click the `🔌 Connect` button and follow the instructions.
ru: ✅ <b>Оплата прошла успешно!</b> 🔑 <b>Ваш ключ:</b> <pre>{key}</pre> <i>Ключ будет сохранен в вашем профиле.</i> Чтобы начать пользоваться нашим сервисом, нажмите кнопку <code>`🔌 Подключиться`</code> и следуйте инструкциям.

# payment:message:extend_success
source: ✅ <b>Payment successful!</b> Your subscription has been extended for {duration}.
ru: ✅ <b>Оплата прошла успешно!</b> Ваша подписка продлена на {duration}.

# payment:message:change_success
source: ✅ <b>Payment successful!</b> Your subscription has been updated to {device} and {duration}.
ru: ✅ <b>Оплата прошла успешно!</b> Ваша подписка была обновлена ​​на {device} и {duration}.

source: MB
ru: МБ

source: GB
ru: ГБ

source: TB
ru: ТБ

source: PB
ru: ПБ

source: EB
ru: ЭБ

source: ZB
ru: ЗБ

source: YB
ru: ЙБ

source: d
ru: д

source: h
ru: ч

source: m
ru: м

source: devices
ru: устройств

source: 1 device
ru: 1 устройство

source: 1 year
ru: 1 год

source: 1 month
ru: 1 месяц
